Reports/ИнтернетЗаявкиЗвонкиИДругиеСпособыЗакрытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Report>
		<Properties>
			<Name>ИнтернетЗаявкиЗвонкиИДругиеСпособыЗакрытия</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекВариант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Варианты</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РучнойРасчет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомернойЭлемент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Закупка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыкупИсключаемыеСессииНЭ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сессия</Name>
							<Comment>Сессия номерного элемента</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/Звонки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>Звонки</Name>
			<Comment>Реестр входящих и исходящих звонков</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата и время выполнения звонка</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Comment>Регион внешнего абонента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Comment>Сервер телефонии</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелСерверы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принят</Name>
					<Comment>Индикатор состоявшегося звонка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Comment>Инициатор звонка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнешние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗаписи</Name>
					<Comment>Имя файла с записью звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВходящий</Name>
					<Comment>Направление звонка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнешний</Name>
					<Comment>Телефон внешнего абонента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнутренний</Name>
					<Comment>Телефон внутреннего абонента завершившего звонок</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходаОчередь</Name>
					<Comment>Под каким порядковым номером звонок помещен в очередь</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВыходаОчередь</Name>
					<Comment>Под каким порядковым номером звонок был в очереди, когода абонент прервал вызов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>Сигнатура звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ИнтернетЗаявкиЗвонкиИДругиеСпособыЗакрытия/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если отчет открывается в режиме расшифровки основного, то ПриСозданииНаСервере доступны параметры основного отчета, а ПриОткрытии() - уже нет, т.к. не являются ключевыми
	Элементы.Вариант.СписокВыбора.Добавить("ЗвонкиВсеПоИнтернетЗаявкам",		"Все (состоявшиеся и несостоявшиеся) заявки");     
	Элементы.Вариант.СписокВыбора.Добавить("ЗвонкиВсеПоИнтернетЗаявкамДетально","Все (состоявшиеся и несостоявшиеся) заявки детально (на одну заявку может быть несколько звонков)");  
	Элементы.Вариант.СписокВыбора.Добавить("ЗвонкиНесостоявшиесяПоИнтернетЗаявкамСводно","Несостоявшиеся заявки - история дальнейшей обработки сводно");  
	Элементы.Вариант.СписокВыбора.Добавить("ЗвонкиНесостоявшиесяПоИнтернетЗаявкамДетально","Несостоявшиеся заявки - история дальнейшей обработки детально");  
	
	//Если открываемый отчет - расшифровка основного отчета, установи период из основного отчета
	Прд = "";
	Доступно = Параметры.Свойство("Период", Прд) И ЗначениеЗаполнено(Параметры.Период.ДатаОкончания);
	Если Доступно Тогда
		Отчет.Период.ДатаОкончания  = Параметры.Период.ДатаОкончания;
		Отчет.Период.ДатаНачала 	= Параметры.Период.ДатаНачала;	
	КонецЕсли;
	
	//Если открываемый отчет - расшифровка основного отчета, установи вариант как в основном отчете
	Вар = "";
	Доступно = Параметры.Свойство("ТекВариант", Вар) И ЗначениеЗаполнено(Параметры.ТекВариант);
	Если Доступно Тогда
		Отчет.ТекВариант = Параметры.ТекВариант;
	Иначе
		//Вариант по умолчанию, при вызове отчета из меню
		Отчет.ТекВариант = "ЗвонкиВсеПоИнтернетЗаявкам";
	КонецЕсли;
	
	Элементы.ГруппаПрочее.Видимость = Истина;
	ВариантОбработкаВыбораНаСервере(Отчет.ТекВариант);	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьНастроек(Команда)
	Элементы.ГруппаСтраницы.Видимость = НЕ Элементы.ГруппаСтраницы.Видимость;
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Отчет.Период.ДатаОкончания) Тогда
		Отчет.Период.ДатаОкончания 	= Отчет.Период.ДатаОкончания;
		Отчет.Период.ДатаНачала 	= Отчет.Период.ДатаНачала;	
	Иначе
		Отчет.Период.ДатаОкончания 	= КонецДня(НачалоДня(ТекущаяДата())-1);
		Отчет.Период.ДатаНачала		= НачалоМесяца(Отчет.Период.ДатаОкончания);
	КонецЕсли;
	
	Элементы.ГруппаСтраницы.Видимость = Ложь;	
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода(); 
	Диалог.Период = Отчет.Период; 
	
	Если Диалог.Редактировать() Тогда 
		Отчет.Период = Диалог.Период; 
	КонецЕсли;
	
	ОбновитьОтображение();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображение()
	Элементы.ВыборПериода.Заголовок = " "+Формат(Отчет.Период.ДатаНачала, "ДЛФ=Д")+" - "+Формат(Отчет.Период.ДатаОкончания, "ДЛФ=Д");
	Элементы.ВидимостьНастроек.Пометка = Элементы.ГруппаСтраницы.Видимость;
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	//КонтрольДоступа.УстановитьОтборПоДоступнымТочкамОформленияВОтчете(Настройки, Отчет.КомпоновщикНастроек);       
	//КонтрольДоступа.УстановитьМакетОформленияОтчета(Настройки, Отчет.КомпоновщикНастроек);
КонецПроцедуры

#Область Расшифровка
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Расш = РезультатОбработкаРасшифровкиНаСервере(Расшифровка);    
	Если Не ЗначениеЗаполнено(Расш.Поле) Тогда
		Возврат
	КонецЕсли;
	
	//Если пользователь пытается открыть список звонков
	//--------------------------------------------------
	Доступно = Расш.Поле = "Звонок" И ЗначениеЗаполнено(Расш.Значение);
	Если Доступно Тогда
		СтандартнаяОбработка = Ложь;
		Парам = Новый Структура("Отбор", Новый Структура("Сигнатура", Расш.Значение)); 
    	ОткрытьФорму("РегистрСведений.Звонки.ФормаСписка", Парам);
		Возврат;	 	
	КонецЕсли;    

КонецПроцедуры

&НаСервере
Функция РезультатОбработкаРасшифровкиНаСервере(Расшифровка)
	Перем Рез;
	Рез = Новый Структура("Поле, Значение", " "", """);
	
	РасшифровкаОтчета = ПолучитьИзВременногоХранилища(ЭтаФорма.ДанныеРасшифровки);
	ЭлементыРасшифровки = РасшифровкаОтчета.Элементы;
	РасшифровкаЯчейки =  ЭлементыРасшифровки.Получить(Расшифровка);
	ЗначенияПолейРасш = РасшифровкаЯчейки.ПолучитьПоля();
	ЗначениеПоляРасш = ЗначенияПолейРасш.Получить(0);
	
	ЗаполнитьЗначенияСвойств(Рез, ЗначениеПоляРасш);
	Возврат Рез;
КонецФункции
#КонецОбласти

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#Область Выбор_варианта
&НаСервере
Процедура ВариантОбработкаВыбораНаСервере(ИмяВарианта)
	Результат.Очистить();
	
	Об 							= РеквизитФормыВЗначение("Отчет");
	СхемаКомпоновкиДанных 		= РеквизитФормыВЗначение("Отчет").ПолучитьСКД(ИмяВарианта, "C:\Users\Public\Documents\"+ИмяВарианта+".xml");
	АдресВремХран				= ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	ИсточникДоступныхНастроек 	= Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВремХран);
	Отчет.КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек);
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
КонецПроцедуры

&НаКлиенте
Процедура ВариантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ВариантОбработкаВыбораНаСервере(ВыбранноеЗначение)
КонецПроцедуры
#КонецОбласти
